In [21]:
import pandas as pd
df = pd.read_csv("cars_24_combined.csv")
df.head ()

,Unnamed: 0,Car Name,Year,Distance,Owner,Fuel,Location,Drive,Type,Price
0,0,Maruti S PRESSO,2022.0,3878,1,PETROL,HR-98,Manual,HatchBack,514000
1,1,Hyundai Xcent,2018.0,32041,1,PETROL,TN-22,Manual,Sedan,674000
2,2,Tata Safari,2021.0,96339,1,DIESEL,TS-08,Automatic,SUV,1952000
3,3,Maruti Vitara Brezza,2019.0,51718,1,DIESEL,WB-24,Manual,SUV,690000
4,4,Tata Tiago,2021.0,19811,1,PETROL,HR-51,Manual,HatchBack,526000

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8015 entries, 0 to 8014
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  8015 non-null   int64
 1   Car Name    8014 non-null   object
 2   Year        8014 non-null   float64
 3   Distance    8015 non-null   int64
 4   Owner       8015 non-null   int64
 5   Fuel        8015 non-null   object
 6   Location    7802 non-null   object
 7   Drive       8015 non-null   object
 8   Type        8015 non-null   object
 9   Price       8015 non-null   int64
dtypes: float64(1), int64(4), object(5)
memory usage: 626.3+ KB

In [23]:
df.columns

Index(['Unnamed: 0', 'Car Name', 'Year', 'Distance', 'Owner', 'Fuel',
       'Location', 'Drive', 'Type', 'Price'],
      dtype='object')

In [24]:
df = df.drop(columns=["Unnamed: 0"])
df.head ()

,Car Name,Year,Distance,Owner,Fuel,Location,Drive,Type,Price
0,Maruti S PRESSO,2022.0,3878,1,PETROL,HR-98,Manual,HatchBack,514000
1,Hyundai Xcent,2018.0,32041,1,PETROL,TN-22,Manual,Sedan,674000
2,Tata Safari,2021.0,96339,1,DIESEL,TS-08,Automatic,SUV,1952000
3,Maruti Vitara Brezza,2019.0,51718,1,DIESEL,WB-24,Manual,SUV,690000
4,Tata Tiago,2021.0,19811,1,PETROL,HR-51,Manual,HatchBack,526000

In [25]:
df.isnull().sum()

Car Name      1
Year          1
Distance      0
Owner         0
Fuel          0
Location    213
Drive         0
Type          0
Price         0
dtype: int64

In [26]:
df[df["Car Name"].isnull()]

,Car Name,Year,Distance,Owner,Fuel,Location,Drive,Type,Price
4901,NaN,NaN,13794,1,PETROL,DL-14,Automatic,Sedan,976000

In [27]:
df = df.dropna(subset=["Car Name", "Year"])
df.shape

(8014, 9)

In [28]:
df["Year"].dtype

dtype('float64')

In [29]:
df["Year"] = df["Year"].astype("int64")
df["Year"].dtype

dtype('int64')

In [30]:
df.duplicated().sum()

np.int64(0)

In [31]:
df["Location"].isnull().sum()

np.int64(213)

In [32]:
df["Location"] = df["Location"].fillna("unknown")

In [20]:
df["Location"].isnull().sum()

np.int64(0)

In [33]:
df["Car Name"].head()

0         Maruti S PRESSO
1           Hyundai Xcent
2             Tata Safari
3    Maruti Vitara Brezza
4              Tata Tiago
Name: Car Name, dtype: object

In [34]:
df["Car Name"].str.lower().head()

0         maruti s presso
1           hyundai xcent
2             tata safari
3    maruti vitara brezza
4              tata tiago
Name: Car Name, dtype: object

In [41]:
df["Car Name"].nunique( )

126

In [42]:
df["Car Name"].str.split().head()

0         [Maruti, S, PRESSO]
1            [Hyundai, Xcent]
2              [Tata, Safari]
3    [Maruti, Vitara, Brezza]
4               [Tata, Tiago]
Name: Car Name, dtype: object

In [45]:
df["Brand"] = df["Car Name"].str.split().str[0]
df["Model"] = df["Car Name"].str.split().str[1:].str.join(" ")
df[["Car Name", "Brand", "Model"]].head()

               Car Name    Brand          Model
0       Maruti S PRESSO   Maruti       S PRESSO
1         Hyundai Xcent  Hyundai          Xcent
2           Tata Safari     Tata         Safari
3  Maruti Vitara Brezza   Maruti  Vitara Brezza
4            Tata Tiago     Tata          Tiago

In [46]:
df["Brand"] = df["Brand"].str.title()
df["Model"] = df["Model"].str.title()
df[["Brand", "Model"]].head()

     Brand          Model
0   Maruti       S Presso
1  Hyundai          Xcent
2     Tata         Safari
3   Maruti  Vitara Brezza
4     Tata          Tiago

In [47]:
df[["Car Name", "Brand", "Model"]].sample(10)

               Car Name    Brand      Model
6709       Maruti Swift   Maruti      Swift
2324  Hyundai Grand i10  Hyundai  Grand I10
427          Tata Tiago     Tata      Tiago
6692       Renault Kwid  Renault       Kwid
558   Hyundai Grand i10  Hyundai  Grand I10
3621       Renault Kwid  Renault       Kwid
5884         Honda City    Honda       City
5739       Toyota YARIS   Toyota      Yaris
4367        Maruti Ritz   Maruti       Ritz
4938      Maruti Baleno   Maruti     Baleno

In [48]:
df = df.drop(columns=["Car Name"])
df.head()

,Year,Distance,Owner,Fuel,Location,Drive,Type,Price,Brand,Model
0,2022,3878,1,PETROL,HR-98,Manual,HatchBack,514000,Maruti,S Presso
1,2018,32041,1,PETROL,TN-22,Manual,Sedan,674000,Hyundai,Xcent
2,2021,96339,1,DIESEL,TS-08,Automatic,SUV,1952000,Tata,Safari
3,2019,51718,1,DIESEL,WB-24,Manual,SUV,690000,Maruti,Vitara Brezza
4,2021,19811,1,PETROL,HR-51,Manual,HatchBack,526000,Tata,Tiago

In [51]:
df["Fuel"].unique()

array(['PETROL', 'DIESEL', 'CNG', 'LPG'], dtype=object)

In [52]:
df["Fuel"] = df["Fuel"].str.title()
df["Fuel"].unique()

array(['Petrol', 'Diesel', 'Cng', 'Lpg'], dtype=object)

In [53]:
df["Fuel"] = df["Fuel"].replace({
    "Cng" : "CNG",
    "Lpg" : "LPG"
})

In [55]:
df["Drive"].unique()

array(['Manual', 'Automatic'], dtype=object)

In [56]:
df["Type"].unique()

array(['HatchBack', 'Sedan', 'SUV', 'Lux_SUV', 'Lux_sedan'], dtype=object)

In [59]:
df["Type"] = df["Type"].replace({
    "HatchBack" : "Hatchback",
    "Lux_SUV" : "Lux SUV",
    "Lux_sedan" : "Lux Sedan"
})
df["Type"].unique()

array(['Hatchback', 'Sedan', 'SUV', 'Lux SUV', 'Lux Sedan'], dtype=object)

In [60]:
df.describe()

              Year       Distance        Owner         Price
count  8014.000000    8014.000000  8014.000000  8.014000e+03
mean   2016.995009   52626.256676     1.300225  5.748328e+05
std       2.861454   29181.519800     0.510914  2.650835e+05
min    2010.000000       0.000000     1.000000  1.190000e+05
25%    2015.000000   30736.750000     1.000000  3.930000e+05
50%    2017.000000   50369.500000     1.000000  5.350000e+05
75%    2019.000000   71762.500000     2.000000  6.980000e+05
max    2023.000000  971212.000000     4.000000  3.300000e+06

In [65]:
df.to_csv("cars24_cleaned.csv", index=False)

In [64]:
df["Location"] = df["Location"].replace({
    "unknown" : "Unknown"
})